{
    "lists":{
        "nav_bar":{
          "home":"Home",
          "skills":"Skills",
          "projects":"Projects",
          "testimonial":"Testimonials",
          "about":"About"
        },
        "muhammad": "Muhamma",
        "osama":"Osama",
        "bio": "Frontend Developer with expertise in React, Next.js, Redux Toolkit, and Tailwind CSS. Experienced in delivering scalable, user-friendly web solutions across diverse industries. Passionate about creating impactful digital experiences. Let’s build something great together!",
        "exp": "Experienced",
        "my":"My",
        "skills":"Skills",
        "innovation": "Innovation",
        "imaginative": "Imaginative",
        "use": "I USE",
        "to_create": "TO CREATE",
        "beautiful": "BEAUTIFUL ",
        "responsive": "RESPONSIVE WEBSITES",
        "projects": "PROJECTS",
        "ux": "BEAUTIFUL USER INTERFACES",
        "smooth": "SMOOTH USER EXPERIENCE",
        "dynamic": "DYANAMIC & STATIC",
        "sfb_desc": "Built a Drag-and-drop form builder, similar to Canva. Utilized technologies like Redux, Tailwind, OTP, and displayed data through graphs. Collaborated with cross-functional teams on multiple microservices. Acquired knowledge about libraries for internationalization, implementing changes for English and Arabic (Right to Left). Demonstrated experience in integrating and managing payment systems (Moyassar) within web applications. Wrote clean, maintainable code and developed helper functions and reusable components.",
        "travel_desc": "Discover a captivating travel website that showcases real-time posts from fellow travelers. This impressive full-stack app, powered by Next.js 13, TypeScript, Prisma, and MongoDB, enables users to store and explore a wide range of travel experiences shared by new members joining the platform.",
        "home_desc": "HomeRun: Is a E-commerce website with custom backend entries and secure payemnt linked with STRIPE payment method.It utilizes Redux toolkit as state managment tool, Prisma and Tailwind CSS",
        "game_desc": "A 3D game that uses Threejs and Convex as a backend. The game is responsive AI which allows for better immersion. You can look at the crime scene, Speack with the medical examinar and then confront the suspect!. Step into the shoes of a detective tasked with solving a high-stakes case involving an AI culprit. Interrogate, investigate, and uncover the truth to bring the rogue AI to justice",
        "series_desc": "A modern movie website that showcases upcoming movies, provides reviews and ratings and allows users to search. It utilizes Redux Toolkit for state management and OAuth with Firebase for authentication of users.",
        "code_desc": "Contributed to an open source project. Code Racer, a community project built with Next.js, Tailwind CSS, and TypeScript. Code Racer is a multiplayer coding game where developers can compete against each other to solve programming challenges in real-time. Sharpen your coding skills, challenge your peers, and have fun while racing against the clock!",
        "superkick_desc": "As part of the Superkick Branding team, I contributed to the development of multiple modern websites that effectively rebranded companies and aligned them with their missions.",
        "imaginify_desc": "Imaginify: Is a web platform that utilizes OpenAI's DALL-E API to generate images based on prompts provided by the user. In addition to the AI-generated images, the app also provides a library of high-definition, royalty-free images from Unsplash, allowing users to browse and download images to use in their projects.",
        "renewbe_desc": "Renewbe: A community-driven platform to support local clean energy, save money and help environmental NGOs Subscribe to use or rent a solar panel in a remote location to support clean energy in your country and save money from your electricity bill.",
        "testimonials": "TESTIMONIALS",
        "testimonials_desc": "Here's What People are Saying About My Work.",
        "bernard": "Muhammad extraordinarily contributed to the successful results. I thus can recommend Muhammad as an enduring, focused, and creative team player that is essential for successful innovation challenges.",
        "bernard_comp": "R&D - Fachexperte Produktdigitalisierung bei Lindner Recyclingtech",
        "max": "Muhammad has done excellent work for my company and its clients. He takes direction well and delivers work on time and with results that clients have been thrilled with.",
        "max_comp": "Marketing Director, Co Founder at Superkick Branding",
        "juxhina": "Muhammad is a very creative web developer. His passion for his profession translates into his enthusiasm to provide a great service and product, his diligence and his positivism toward larger goals.",
        "juxhina_comp": "Content Marketing Team Lead at Empact Partners",
        "marina": "I was positively surprised by how quickly he could adapt to changes and new ideas and by how he could always put his tech and design skills into practice. But most importantly, he is a kind and committed fellow who will bring great energy to any team.",
        "marina_comp": "Copyeditor at CNN en Español",
        "dania": "I had the pleasure of working with Muhammed , and his development skills are truly exceptional. He has a remarkable ability to transform complex ideas into sleek, user-friendly interfaces while ensuring high performance and scalability. Muhammed is a reliable, innovative, and collaborative professional who would be a great asset to any team.",
        "dania_comp": "Project Manager at Sustainable Star LLC",
        "my_achivements": "ACHIEVEMENTS & More!",
        "discover": "Discover More About Me",
        "present_sfb":"Presented Sustainable Form Builder at",
        "exp_working":"Experience in working with",
        "teams":"Teams",
        "tech_lead_renewbe":"Tech lead for Renewbe , Co-founder and",
        "developer":"Developer",
        "for_renewbe":"for Renewbe",
        "renewbe_company_i":"Renewbe company I Co-founded",
        "won":"won",
        "first_prize":"First Prize",
        "efa":"in the European Forum Alpbach along with seed fund, Renewbe was the first prize winner during the European Forum Alpbach",
        "tech_lead":"Tech Lead",
        "for_hult":" for Hult Prize Austria",
        "participated":"Participated in",
        "actions": {
          "get_in_touch": "Get In Touch With Me",
          "demo":"Demo Website",
          "website": "Visit Website",
          "view_code": "View Code",
          "home": "Home",
          "skills": "Skills",
          "projects": "Projects",
          "testimonial": "Testimonials",
          "contact": "Contact"
        }
    }
   
  }
  