{
    "lists":{
        "nav_bar": {
          "home": "الرئيسية",
          "skills": "المهارات",
          "projects": "المشاريع",
          "testimonial": "الشهادات"
        },
        "muhammad": "محمد",
        "osama":"أسامة",
        "bio": "مطور واجهات أمامية بخبرة في React، Next.js، Redux Toolkit، و Tailwind CSS. متمرس في تقديم حلول ويب قابلة للتوسع وسهلة الاستخدام عبر صناعات متنوعة. شغوف بإنشاء تجارب رقمية مؤثرة. دعونا نبني شيئًا رائعًا معًا!",
        "exp": "ذو خبرة",
        "my": "خاصتي",
        "skills": "مهارات",
        "innovation": "الابتكار",
        "imaginative": "خيالي",
        "use": "أستخدم",
        "to_create": "لإنشاء",
        "beautiful": "مواقع ",
        "responsive": "متجاوبة",
        "projects": "المشاريع",
        "ux": "واجهات مستخدم جميلة",
        "smooth": "تجربة مستخدم سلسة",
        "dynamic": "ديناميكية وثابتة",
        "sfb_desc": "تم بناء منشئ نماذج سحب وإفلات، مشابه لـ Canva. استخدمت تقنيات مثل Redux، Tailwind، OTP، وعرض البيانات من خلال الرسوم البيانية. تعاونت مع فرق متعددة الوظائف في العديد من الخدمات المصغرة. اكتسبت معرفة بالمكتبات الدولية، وتطبيق التغييرات للغات الإنجليزية والعربية (من اليمين إلى اليسار). أظهرت خبرة في دمج وإدارة أنظمة الدفع (Moyassar) داخل تطبيقات الويب. كتبت كود نظيف وقابل للصيانة وطورت وظائف مساعدة ومكونات قابلة لإعادة الاستخدام.",
        "travel_desc": "اكتشف موقع سفر جذاب يعرض منشورات مباشرة من المسافرين. هذا التطبيق الكامل، الذي يعتمد على Next.js 13، TypeScript، Prisma، و MongoDB، يتيح للمستخدمين تخزين واستكشاف تجارب سفر متنوعة يشاركها الأعضاء الجدد على المنصة.",
        "home_desc": "HomeRun: هو موقع تجارة إلكترونية يحتوي على إدخالات خلفية مخصصة ودفع آمن مرتبط بطريقة الدفع STRIPE. يستخدم Redux Toolkit كأداة لإدارة الحالة، Prisma و Tailwind CSS.",
        "game_desc": "لعبة ثلاثية الأبعاد تستخدم Threejs و Convex كواجهة خلفية. اللعبة تتميز بذكاء اصطناعي متجاوب لتحسين الانغماس. يمكنك استكشاف مسرح الجريمة، التحدث مع الطبيب الشرعي، ثم مواجهة المشتبه به! أدخل دور المحقق المكلف بحل قضية حساسة تتعلق بمجرم ذكاء اصطناعي. استجوب، تحقق، واكشف الحقيقة لتحقيق العدالة.",
        "series_desc": "موقع أفلام حديث يعرض الأفلام القادمة، ويوفر مراجعات وتقييمات، ويسمح للمستخدمين بالبحث. يستخدم Redux Toolkit لإدارة الحالة و OAuth مع Firebase للمصادقة.",
        "code_desc": "ساهمت في مشروع مفتوح المصدر. Code Racer، مشروع مجتمعي مبني باستخدام Next.js، Tailwind CSS، و TypeScript. Code Racer هي لعبة ترميز متعددة اللاعبين حيث يمكن للمطورين التنافس لحل تحديات البرمجة في الوقت الفعلي. قم بتطوير مهاراتك البرمجية، تحدى زملائك، واستمتع بالسباق مع الوقت!",
        "superkick_desc": "كجزء من فريق Superkick Branding، ساهمت في تطوير العديد من المواقع الحديثة التي أعادت تصميم الشركات بشكل فعال ونسقتها مع مهماتها.",
        "imaginify_desc": "Imaginify: منصة ويب تستخدم واجهة برمجة التطبيقات OpenAI's DALL-E لإنشاء صور بناءً على التعليمات التي يقدمها المستخدم. بالإضافة إلى الصور التي يتم إنشاؤها بالذكاء الاصطناعي، يوفر التطبيق مكتبة من الصور عالية الدقة والخالية من حقوق الملكية من Unsplash، مما يسمح للمستخدمين بتصفح وتنزيل الصور لاستخدامها في مشاريعهم.",
        "renewbe_desc": "Renewbe: منصة مجتمعية لدعم الطاقة النظيفة المحلية، توفير المال، ومساعدة المنظمات البيئية غير الحكومية. اشترك لاستخدام أو استئجار لوحة شمسية في موقع بعيد لدعم الطاقة النظيفة في بلدك وتوفير المال على فاتورة الكهرباء الخاصة بك.",
        "testimonials": "الشهادات",
        "testimonials_desc": "إليك ما يقوله الناس عن عملي.",
        "bernard": "ساهم محمد بشكل استثنائي في تحقيق نتائج ناجحة. لذا يمكنني أن أوصي بمحمد كلاعب فريق دائم ومركز ومبدع وهو أمر ضروري لتحديات الابتكار الناجحة.",
        "bernard_comp": "البحث والتطوير - خبير الرقمنة في Lindner Recyclingtech",
        "max": "لقد قام محمد بعمل ممتاز لشركتي ولعملائها. يتلقى التوجيه بشكل جيد ويسلم العمل في الوقت المحدد بنتائج أعجبت بها العملاء.",
        "max_comp": "مدير التسويق، المؤسس المشارك في Superkick Branding",
        "juxhina": "محمد مطور ويب مبدع للغاية. حبه لمهنته ينعكس في حماسه لتقديم خدمة ومنتج رائعين، واجتهاده وإيجابيته تجاه الأهداف الأكبر.",
        "juxhina_comp": "قائدة فريق تسويق المحتوى في Empact Partners",
        "marina": "لقد فوجئت إيجابياً بمدى سرعته في التكيف مع التغييرات والأفكار الجديدة، وبكيف يمكنه دائمًا تطبيق مهاراته التقنية والتصميمية عمليًا. ولكن الأهم من ذلك، أنه زميل طيب وملتزم سيجلب طاقة رائعة لأي فريق.",
        "marina_comp": "محررة نسخ في CNN en Español",
        "dania": "لقد كان لي شرف العمل مع محمد، ومهاراته في التطوير استثنائية حقًا. لديه قدرة رائعة على تحويل الأفكار المعقدة إلى واجهات أنيقة وسهلة الاستخدام مع ضمان الأداء العالي والقابلية للتوسع. محمد محترف موثوق ومبتكر وتعاوني سيكون إضافة كبيرة لأي فريق.",
        "dania_comp": "مديرة مشروع في Sustainable Star LLC",
        "my_achivements": "إنجازاتي والمزيد!",
        "discover": "اكتشف المزيد عني",
        "present_sfb": "قدمت منشئ النماذج المستدامة في",
        "exp_working": "خبرة في العمل مع",
        "teams": "فرق",
        "tech_lead_renewbe": "قائد تقني لـ Renewbe، والمؤسس المشارك و",
        "developer": "مطور",
        "for_renewbe": "لـ Renewbe",
        "renewbe_company_i": "شركة Renewbe التي شاركت في تأسيسها",
        "won": "فازت",
        "first_prize": "بالمركز الأول",
        "efa": "في المنتدى الأوروبي ألباخ مع تمويل بذري، حيث فازت Renewbe بالمركز الأول خلال المنتدى الأوروبي ألباخ",
        "tech_lead": "القائد التقني",
        "for_hult": "لجائزة هالت في النمسا",
        "participated": "شاركت في",
        "actions": {
          "get_in_touch": "تواصل معي",
          "demo": "موقع تجريبي",
          "website": "قم بزيارة الموقع",
          "view_code": "عرض الكود",
          "home": "الرئيسية",
          "skills": "المهارات",
          "projects": "المشاريع",
          "testimonial": "الشهادات",
          "contact": "تواصل"
        }
    }
   
  }
  